rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPI_MSC.h
#define DSPI_SR_DPEF_MASK                    (0x400000U)
#define DSPI_SR_DPEF_SHIFT                   (22U)
#define DSPI_SR_DPEF_WIDTH                   (1U)
#define DSPI_SR_DPEF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SR_DPEF_SHIFT)) & DSPI_SR_DPEF_MASK)

#define DSPI_SR_CMDTCF_MASK                  (0x800000U)
#define DSPI_SR_CMDTCF_SHIFT                 (23U)
#define DSPI_SR_CMDTCF_WIDTH                 (1U)
#define DSPI_SR_CMDTCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_SR_CMDTCF_SHIFT)) & DSPI_SR_CMDTCF_MASK)

#define DSPI_SR_BSYF_MASK                    (0x1000000U)
#define DSPI_SR_BSYF_SHIFT                   (24U)
#define DSPI_SR_BSYF_WIDTH                   (1U)
#define DSPI_SR_BSYF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SR_BSYF_SHIFT)) & DSPI_SR_BSYF_MASK)

#define DSPI_SR_TFFF_MASK                    (0x2000000U)
#define DSPI_SR_TFFF_SHIFT                   (25U)
#define DSPI_SR_TFFF_WIDTH                   (1U)
#define DSPI_SR_TFFF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SR_TFFF_SHIFT)) & DSPI_SR_TFFF_MASK)

#define DSPI_SR_DSITCF_MASK                  (0x4000000U)
#define DSPI_SR_DSITCF_SHIFT                 (26U)
#define DSPI_SR_DSITCF_WIDTH                 (1U)
#define DSPI_SR_DSITCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_SR_DSITCF_SHIFT)) & DSPI_SR_DSITCF_MASK)

#define DSPI_SR_EOQF_MASK                    (0x10000000U)
#define DSPI_SR_EOQF_SHIFT                   (28U)
#define DSPI_SR_EOQF_WIDTH                   (1U)
#define DSPI_SR_EOQF(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SR_EOQF_SHIFT)) & DSPI_SR_EOQF_MASK)

#define DSPI_SR_SPITCF_MASK                  (0x20000000U)
#define DSPI_SR_SPITCF_SHIFT                 (29U)
#define DSPI_SR_SPITCF_WIDTH                 (1U)
#define DSPI_SR_SPITCF(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_SR_SPITCF_SHIFT)) & DSPI_SR_SPITCF_MASK)

#define DSPI_SR_TXRXS_MASK                   (0x40000000U)
#define DSPI_SR_TXRXS_SHIFT                  (30U)
#define DSPI_SR_TXRXS_WIDTH                  (1U)
#define DSPI_SR_TXRXS(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_SR_TXRXS_SHIFT)) & DSPI_SR_TXRXS_MASK)

#define DSPI_SR_TCF_MASK                     (0x80000000U)
#define DSPI_SR_TCF_SHIFT                    (31U)
#define DSPI_SR_TCF_WIDTH                    (1U)
#define DSPI_SR_TCF(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_SR_TCF_SHIFT)) & DSPI_SR_TCF_MASK)
/*! @} */

/*! @name RSER - DMA/Interrupt Request Select and Enable Register */
/*! @{ */

#define DSPI_RSER_DDIF_DIRS_MASK             (0x4000U)
#define DSPI_RSER_DDIF_DIRS_SHIFT            (14U)
#define DSPI_RSER_DDIF_DIRS_WIDTH            (1U)
#define DSPI_RSER_DDIF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DDIF_DIRS_SHIFT)) & DSPI_RSER_DDIF_DIRS_MASK)

#define DSPI_RSER_CMDFFF_DIRS_MASK           (0x8000U)
#define DSPI_RSER_CMDFFF_DIRS_SHIFT          (15U)
#define DSPI_RSER_CMDFFF_DIRS_WIDTH          (1U)
#define DSPI_RSER_CMDFFF_DIRS(x)             (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDFFF_DIRS_SHIFT)) & DSPI_RSER_CMDFFF_DIRS_MASK)

#define DSPI_RSER_RFDF_DIRS_MASK             (0x10000U)
#define DSPI_RSER_RFDF_DIRS_SHIFT            (16U)
#define DSPI_RSER_RFDF_DIRS_WIDTH            (1U)
#define DSPI_RSER_RFDF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFDF_DIRS_SHIFT)) & DSPI_RSER_RFDF_DIRS_MASK)

#define DSPI_RSER_RFDF_RE_MASK               (0x20000U)
#define DSPI_RSER_RFDF_RE_SHIFT              (17U)
#define DSPI_RSER_RFDF_RE_WIDTH              (1U)
#define DSPI_RSER_RFDF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFDF_RE_SHIFT)) & DSPI_RSER_RFDF_RE_MASK)

#define DSPI_RSER_TFIWF_RE_MASK              (0x40000U)
#define DSPI_RSER_TFIWF_RE_SHIFT             (18U)
#define DSPI_RSER_TFIWF_RE_WIDTH             (1U)
#define DSPI_RSER_TFIWF_RE(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFIWF_RE_SHIFT)) & DSPI_RSER_TFIWF_RE_MASK)

#define DSPI_RSER_RFOF_RE_MASK               (0x80000U)
#define DSPI_RSER_RFOF_RE_SHIFT              (19U)
#define DSPI_RSER_RFOF_RE_WIDTH              (1U)
#define DSPI_RSER_RFOF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFOF_RE_SHIFT)) & DSPI_RSER_RFOF_RE_MASK)

#define DSPI_RSER_DDIF_RE_MASK               (0x100000U)
#define DSPI_RSER_DDIF_RE_SHIFT              (20U)
#define DSPI_RSER_DDIF_RE_WIDTH              (1U)
#define DSPI_RSER_DDIF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DDIF_RE_SHIFT)) & DSPI_RSER_DDIF_RE_MASK)

#define DSPI_RSER_SPEF_RE_MASK               (0x200000U)
#define DSPI_RSER_SPEF_RE_SHIFT              (21U)
#define DSPI_RSER_SPEF_RE_WIDTH              (1U)
#define DSPI_RSER_SPEF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_SPEF_RE_SHIFT)) & DSPI_RSER_SPEF_RE_MASK)

#define DSPI_RSER_DPEF_RE_MASK               (0x400000U)
#define DSPI_RSER_DPEF_RE_SHIFT              (22U)
#define DSPI_RSER_DPEF_RE_WIDTH              (1U)
#define DSPI_RSER_DPEF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DPEF_RE_SHIFT)) & DSPI_RSER_DPEF_RE_MASK)

#define DSPI_RSER_CMDTCF_RE_MASK             (0x800000U)
#define DSPI_RSER_CMDTCF_RE_SHIFT            (23U)
#define DSPI_RSER_CMDTCF_RE_WIDTH            (1U)
#define DSPI_RSER_CMDTCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDTCF_RE_SHIFT)) & DSPI_RSER_CMDTCF_RE_MASK)

#define DSPI_RSER_TFFF_DIRS_MASK             (0x1000000U)
#define DSPI_RSER_TFFF_DIRS_SHIFT            (24U)
#define DSPI_RSER_TFFF_DIRS_WIDTH            (1U)
#define DSPI_RSER_TFFF_DIRS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFFF_DIRS_SHIFT)) & DSPI_RSER_TFFF_DIRS_MASK)

#define DSPI_RSER_TFFF_RE_MASK               (0x2000000U)
#define DSPI_RSER_TFFF_RE_SHIFT              (25U)
#define DSPI_RSER_TFFF_RE_WIDTH              (1U)
#define DSPI_RSER_TFFF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFFF_RE_SHIFT)) & DSPI_RSER_TFFF_RE_MASK)

#define DSPI_RSER_DSITCF_RE_MASK             (0x4000000U)
#define DSPI_RSER_DSITCF_RE_SHIFT            (26U)
#define DSPI_RSER_DSITCF_RE_WIDTH            (1U)
#define DSPI_RSER_DSITCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DSITCF_RE_SHIFT)) & DSPI_RSER_DSITCF_RE_MASK)

#define DSPI_RSER_EOQF_RE_MASK               (0x10000000U)
#define DSPI_RSER_EOQF_RE_SHIFT              (28U)
#define DSPI_RSER_EOQF_RE_WIDTH              (1U)
#define DSPI_RSER_EOQF_RE(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_EOQF_RE_SHIFT)) & DSPI_RSER_EOQF_RE_MASK)

#define DSPI_RSER_SPITCF_RE_MASK             (0x20000000U)
#define DSPI_RSER_SPITCF_RE_SHIFT            (29U)
#define DSPI_RSER_SPITCF_RE_WIDTH            (1U)
#define DSPI_RSER_SPITCF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_SPITCF_RE_SHIFT)) & DSPI_RSER_SPITCF_RE_MASK)

#define DSPI_RSER_CMDFFF_RE_MASK             (0x40000000U)
#define DSPI_RSER_CMDFFF_RE_SHIFT            (30U)
#define DSPI_RSER_CMDFFF_RE_WIDTH            (1U)
#define DSPI_RSER_CMDFFF_RE(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDFFF_RE_SHIFT)) & DSPI_RSER_CMDFFF_RE_MASK)

