rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPI_MSC.h
#define DSPI_RSER_TCF_RE_MASK                (0x80000000U)
#define DSPI_RSER_TCF_RE_SHIFT               (31U)
#define DSPI_RSER_TCF_RE_WIDTH               (1U)
#define DSPI_RSER_TCF_RE(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TCF_RE_SHIFT)) & DSPI_RSER_TCF_RE_MASK)
/*! @} */

/*! @name PUSHR - PUSH TX FIFO Register In Master Mode */
/*! @{ */

#define DSPI_PUSHR_TXDATA_MASK               (0xFFFFU)
#define DSPI_PUSHR_TXDATA_SHIFT              (0U)
#define DSPI_PUSHR_TXDATA_WIDTH              (16U)
#define DSPI_PUSHR_TXDATA(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_TXDATA_SHIFT)) & DSPI_PUSHR_TXDATA_MASK)

#define DSPI_PUSHR_PCS_MASK                  (0x30000U)
#define DSPI_PUSHR_PCS_SHIFT                 (16U)
#define DSPI_PUSHR_PCS_WIDTH                 (2U)
#define DSPI_PUSHR_PCS(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PCS_SHIFT)) & DSPI_PUSHR_PCS_MASK)

#define DSPI_PUSHR_PP_MASK                   (0x1000000U)
#define DSPI_PUSHR_PP_SHIFT                  (24U)
#define DSPI_PUSHR_PP_WIDTH                  (1U)
#define DSPI_PUSHR_PP(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PP_SHIFT)) & DSPI_PUSHR_PP_MASK)

#define DSPI_PUSHR_PE_MASK                   (0x2000000U)
#define DSPI_PUSHR_PE_SHIFT                  (25U)
#define DSPI_PUSHR_PE_WIDTH                  (1U)
#define DSPI_PUSHR_PE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PE_SHIFT)) & DSPI_PUSHR_PE_MASK)

#define DSPI_PUSHR_CTCNT_MASK                (0x4000000U)
#define DSPI_PUSHR_CTCNT_SHIFT               (26U)
#define DSPI_PUSHR_CTCNT_WIDTH               (1U)
#define DSPI_PUSHR_CTCNT(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CTCNT_SHIFT)) & DSPI_PUSHR_CTCNT_MASK)

#define DSPI_PUSHR_EOQ_MASK                  (0x8000000U)
#define DSPI_PUSHR_EOQ_SHIFT                 (27U)
#define DSPI_PUSHR_EOQ_WIDTH                 (1U)
#define DSPI_PUSHR_EOQ(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_EOQ_SHIFT)) & DSPI_PUSHR_EOQ_MASK)

#define DSPI_PUSHR_CTAS_MASK                 (0x70000000U)
#define DSPI_PUSHR_CTAS_SHIFT                (28U)
#define DSPI_PUSHR_CTAS_WIDTH                (3U)
#define DSPI_PUSHR_CTAS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CTAS_SHIFT)) & DSPI_PUSHR_CTAS_MASK)

#define DSPI_PUSHR_CONT_MASK                 (0x80000000U)
#define DSPI_PUSHR_CONT_SHIFT                (31U)
#define DSPI_PUSHR_CONT_WIDTH                (1U)
#define DSPI_PUSHR_CONT(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CONT_SHIFT)) & DSPI_PUSHR_CONT_MASK)
/*! @} */

/*! @name POPR - POP RX FIFO Register */
/*! @{ */

#define DSPI_POPR_RXDATA_MASK                (0xFFFFFFFFU)
#define DSPI_POPR_RXDATA_SHIFT               (0U)
#define DSPI_POPR_RXDATA_WIDTH               (32U)
#define DSPI_POPR_RXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_POPR_RXDATA_SHIFT)) & DSPI_POPR_RXDATA_MASK)
/*! @} */

/*! @name TXFR - Transmit FIFO Registers */
/*! @{ */

#define DSPI_TXFR_TXDATA_MASK                (0xFFFFU)
#define DSPI_TXFR_TXDATA_SHIFT               (0U)
#define DSPI_TXFR_TXDATA_WIDTH               (16U)
#define DSPI_TXFR_TXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_TXFR_TXDATA_SHIFT)) & DSPI_TXFR_TXDATA_MASK)

#define DSPI_TXFR_TXCMD_TXDATA_MASK          (0xFFFF0000U)
#define DSPI_TXFR_TXCMD_TXDATA_SHIFT         (16U)
#define DSPI_TXFR_TXCMD_TXDATA_WIDTH         (16U)
#define DSPI_TXFR_TXCMD_TXDATA(x)            (((uint32_t)(((uint32_t)(x)) << DSPI_TXFR_TXCMD_TXDATA_SHIFT)) & DSPI_TXFR_TXCMD_TXDATA_MASK)
/*! @} */

/*! @name RXFR - Receive FIFO Registers */
/*! @{ */

#define DSPI_RXFR_RXDATA_MASK                (0xFFFFFFFFU)
#define DSPI_RXFR_RXDATA_SHIFT               (0U)
#define DSPI_RXFR_RXDATA_WIDTH               (32U)
#define DSPI_RXFR_RXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_RXFR_RXDATA_SHIFT)) & DSPI_RXFR_RXDATA_MASK)
/*! @} */

/*! @name DSICR0 - DSI Configuration Register 0 */
/*! @{ */

#define DSPI_DSICR0_DPCSx_MASK               (0xFFU)
#define DSPI_DSICR0_DPCSx_SHIFT              (0U)
#define DSPI_DSICR0_DPCSx_WIDTH              (8U)
#define DSPI_DSICR0_DPCSx(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DPCSx_SHIFT)) & DSPI_DSICR0_DPCSx_MASK)

#define DSPI_DSICR0_PP_MASK                  (0x100U)
#define DSPI_DSICR0_PP_SHIFT                 (8U)
#define DSPI_DSICR0_PP_WIDTH                 (1U)
#define DSPI_DSICR0_PP(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PP_SHIFT)) & DSPI_DSICR0_PP_MASK)

#define DSPI_DSICR0_PE_MASK                  (0x200U)
#define DSPI_DSICR0_PE_SHIFT                 (9U)
#define DSPI_DSICR0_PE_WIDTH                 (1U)
#define DSPI_DSICR0_PE(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PE_SHIFT)) & DSPI_DSICR0_PE_MASK)

#define DSPI_DSICR0_PES_MASK                 (0x400U)
#define DSPI_DSICR0_PES_SHIFT                (10U)
#define DSPI_DSICR0_PES_WIDTH                (1U)
#define DSPI_DSICR0_PES(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PES_SHIFT)) & DSPI_DSICR0_PES_MASK)

#define DSPI_DSICR0_DMS_MASK                 (0x800U)
#define DSPI_DSICR0_DMS_SHIFT                (11U)
#define DSPI_DSICR0_DMS_WIDTH                (1U)
#define DSPI_DSICR0_DMS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DMS_SHIFT)) & DSPI_DSICR0_DMS_MASK)

#define DSPI_DSICR0_DSICTAS_MASK             (0x7000U)
#define DSPI_DSICR0_DSICTAS_SHIFT            (12U)
#define DSPI_DSICR0_DSICTAS_WIDTH            (3U)
#define DSPI_DSICR0_DSICTAS(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DSICTAS_SHIFT)) & DSPI_DSICR0_DSICTAS_MASK)

#define DSPI_DSICR0_DCONT_MASK               (0x8000U)
#define DSPI_DSICR0_DCONT_SHIFT              (15U)
#define DSPI_DSICR0_DCONT_WIDTH              (1U)
#define DSPI_DSICR0_DCONT(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DCONT_SHIFT)) & DSPI_DSICR0_DCONT_MASK)

