rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPI_MSC.h
#define DSPI_DSICR0_CID_MASK                 (0x10000U)
#define DSPI_DSICR0_CID_SHIFT                (16U)
#define DSPI_DSICR0_CID_WIDTH                (1U)
#define DSPI_DSICR0_CID(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_CID_SHIFT)) & DSPI_DSICR0_CID_MASK)

#define DSPI_DSICR0_TRRE_MASK                (0x20000U)
#define DSPI_DSICR0_TRRE_SHIFT               (17U)
#define DSPI_DSICR0_TRRE_WIDTH               (1U)
#define DSPI_DSICR0_TRRE(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TRRE_SHIFT)) & DSPI_DSICR0_TRRE_MASK)

#define DSPI_DSICR0_TPOL_MASK                (0x40000U)
#define DSPI_DSICR0_TPOL_SHIFT               (18U)
#define DSPI_DSICR0_TPOL_WIDTH               (1U)
#define DSPI_DSICR0_TPOL(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TPOL_SHIFT)) & DSPI_DSICR0_TPOL_MASK)

#define DSPI_DSICR0_TXSS_MASK                (0x80000U)
#define DSPI_DSICR0_TXSS_SHIFT               (19U)
#define DSPI_DSICR0_TXSS_WIDTH               (1U)
#define DSPI_DSICR0_TXSS(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TXSS_SHIFT)) & DSPI_DSICR0_TXSS_MASK)

#define DSPI_DSICR0_TSBC_MASK                (0x100000U)
#define DSPI_DSICR0_TSBC_SHIFT               (20U)
#define DSPI_DSICR0_TSBC_WIDTH               (1U)
#define DSPI_DSICR0_TSBC(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TSBC_SHIFT)) & DSPI_DSICR0_TSBC_MASK)

#define DSPI_DSICR0_ITSB_MASK                (0x200000U)
#define DSPI_DSICR0_ITSB_SHIFT               (21U)
#define DSPI_DSICR0_ITSB_WIDTH               (1U)
#define DSPI_DSICR0_ITSB(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_ITSB_SHIFT)) & DSPI_DSICR0_ITSB_MASK)

#define DSPI_DSICR0_TRG_MASK                 (0x400000U)
#define DSPI_DSICR0_TRG_SHIFT                (22U)
#define DSPI_DSICR0_TRG_WIDTH                (1U)
#define DSPI_DSICR0_TRG(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TRG_SHIFT)) & DSPI_DSICR0_TRG_MASK)

#define DSPI_DSICR0_FMSZ5_MASK               (0x800000U)
#define DSPI_DSICR0_FMSZ5_SHIFT              (23U)
#define DSPI_DSICR0_FMSZ5_WIDTH              (1U)
#define DSPI_DSICR0_FMSZ5(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_FMSZ5_SHIFT)) & DSPI_DSICR0_FMSZ5_MASK)

#define DSPI_DSICR0_FMSZ4_MASK               (0x40000000U)
#define DSPI_DSICR0_FMSZ4_SHIFT              (30U)
#define DSPI_DSICR0_FMSZ4_WIDTH              (1U)
#define DSPI_DSICR0_FMSZ4(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_FMSZ4_SHIFT)) & DSPI_DSICR0_FMSZ4_MASK)
/*! @} */

/*! @name SDR0 - DSI Serialization Data Register 0 */
/*! @{ */

#define DSPI_SDR0_SER_DATA_MASK              (0xFFFFFFFFU)
#define DSPI_SDR0_SER_DATA_SHIFT             (0U)
#define DSPI_SDR0_SER_DATA_WIDTH             (32U)
#define DSPI_SDR0_SER_DATA(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_SDR0_SER_DATA_SHIFT)) & DSPI_SDR0_SER_DATA_MASK)
/*! @} */

/*! @name ASDR0 - DSI Alternate Serialization Data Register 0 */
/*! @{ */

#define DSPI_ASDR0_ASER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_ASDR0_ASER_DATA_SHIFT           (0U)
#define DSPI_ASDR0_ASER_DATA_WIDTH           (32U)
#define DSPI_ASDR0_ASER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_ASDR0_ASER_DATA_SHIFT)) & DSPI_ASDR0_ASER_DATA_MASK)
/*! @} */

/*! @name COMPR0 - DSI Transmit Comparison Register 0 */
/*! @{ */

#define DSPI_COMPR0_COMP_DATA_MASK           (0xFFFFFFFFU)
#define DSPI_COMPR0_COMP_DATA_SHIFT          (0U)
#define DSPI_COMPR0_COMP_DATA_WIDTH          (32U)
#define DSPI_COMPR0_COMP_DATA(x)             (((uint32_t)(((uint32_t)(x)) << DSPI_COMPR0_COMP_DATA_SHIFT)) & DSPI_COMPR0_COMP_DATA_MASK)
/*! @} */

/*! @name DDR0 - DSI Deserialization Data Register 0 */
/*! @{ */

#define DSPI_DDR0_DESER_DATA_MASK            (0xFFFFFFFFU)
#define DSPI_DDR0_DESER_DATA_SHIFT           (0U)
#define DSPI_DDR0_DESER_DATA_WIDTH           (32U)
#define DSPI_DDR0_DESER_DATA(x)              (((uint32_t)(((uint32_t)(x)) << DSPI_DDR0_DESER_DATA_SHIFT)) & DSPI_DDR0_DESER_DATA_MASK)
/*! @} */

/*! @name DSICR1 - DSI Configuration Register 1 */
/*! @{ */

#define DSPI_DSICR1_DPCS1_x_MASK             (0xFFU)
#define DSPI_DSICR1_DPCS1_x_SHIFT            (0U)
#define DSPI_DSICR1_DPCS1_x_WIDTH            (8U)
#define DSPI_DSICR1_DPCS1_x(x)               (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_DPCS1_x_SHIFT)) & DSPI_DSICR1_DPCS1_x_MASK)

#define DSPI_DSICR1_DSE0_MASK                (0x10000U)
#define DSPI_DSICR1_DSE0_SHIFT               (16U)
#define DSPI_DSICR1_DSE0_WIDTH               (1U)
#define DSPI_DSICR1_DSE0(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_DSE0_SHIFT)) & DSPI_DSICR1_DSE0_MASK)

#define DSPI_DSICR1_DSE1_MASK                (0x20000U)
#define DSPI_DSICR1_DSE1_SHIFT               (17U)
#define DSPI_DSICR1_DSE1_WIDTH               (1U)
#define DSPI_DSICR1_DSE1(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_DSE1_SHIFT)) & DSPI_DSICR1_DSE1_MASK)

#define DSPI_DSICR1_DSI64E_MASK              (0x40000U)
#define DSPI_DSICR1_DSI64E_SHIFT             (18U)
#define DSPI_DSICR1_DSI64E_WIDTH             (1U)
#define DSPI_DSICR1_DSI64E(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_DSI64E_SHIFT)) & DSPI_DSICR1_DSI64E_MASK)

#define DSPI_DSICR1_CSE_MASK                 (0x80000U)
#define DSPI_DSICR1_CSE_SHIFT                (19U)
#define DSPI_DSICR1_CSE_WIDTH                (1U)
#define DSPI_DSICR1_CSE(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_CSE_SHIFT)) & DSPI_DSICR1_CSE_MASK)

#define DSPI_DSICR1_TSBCNT_MASK              (0x3F000000U)
#define DSPI_DSICR1_TSBCNT_SHIFT             (24U)
#define DSPI_DSICR1_TSBCNT_WIDTH             (6U)
#define DSPI_DSICR1_TSBCNT(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR1_TSBCNT_SHIFT)) & DSPI_DSICR1_TSBCNT_MASK)
/*! @} */

/*! @name SSR0 - DSI Serialization Source Select Register 0 */
/*! @{ */

#define DSPI_SSR0_SS_MASK                    (0xFFFFFFFFU)
#define DSPI_SSR0_SS_SHIFT                   (0U)
#define DSPI_SSR0_SS_WIDTH                   (32U)
#define DSPI_SSR0_SS(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SSR0_SS_SHIFT)) & DSPI_SSR0_SS_MASK)
/*! @} */

/*! @name DIMR0 - DSI Deserialized Data Interrupt Mask Register 0 */
/*! @{ */

#define DSPI_DIMR0_MASK_MASK                 (0xFFFFFFFFU)
#define DSPI_DIMR0_MASK_SHIFT                (0U)
#define DSPI_DIMR0_MASK_WIDTH                (32U)
#define DSPI_DIMR0_MASK(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DIMR0_MASK_SHIFT)) & DSPI_DIMR0_MASK_MASK)
/*! @} */

/*! @name DPIR0 - DSI Deserialized Data Polarity Interrupt Register 0 */
/*! @{ */

#define DSPI_DPIR0_DP_MASK                   (0xFFFFFFFFU)
#define DSPI_DPIR0_DP_SHIFT                  (0U)
#define DSPI_DPIR0_DP_WIDTH                  (32U)
#define DSPI_DPIR0_DP(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_DPIR0_DP_SHIFT)) & DSPI_DPIR0_DP_MASK)
/*! @} */

/*! @name SDR1 - DSI Serialization Data Register 1 */
/*! @{ */

#define DSPI_SDR1_SER_DATA_MASK              (0xFFFFFFFFU)
#define DSPI_SDR1_SER_DATA_SHIFT             (0U)
#define DSPI_SDR1_SER_DATA_WIDTH             (32U)
#define DSPI_SDR1_SER_DATA(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_SDR1_SER_DATA_SHIFT)) & DSPI_SDR1_SER_DATA_MASK)
/*! @} */

/*! @name ASDR1 - DSI Alternate Serialization Data Register 1 */
/*! @{ */

